DATA DIVISION.

WORKING-STORAGE SECTION.
01  WS-COUNTER PIC 9(2) VALUE 0. 

PROCEDURE DIVISION.

    PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 10
        DISPLAY "Iteration number: " WS-COUNTER
    END-PERFORM.
    STOP RUN.